tutorials/lagrangian/reactingParcelFilmFoam/rivuletPanel/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFilmModel kinematicSingleLayer;

regionName      wallFilmRegion;

active          true;

kinematicSingleLayerCoeffs
{
    thermoModel constant;
    constantThermoCoeffs
    {
        rho0        rho0 [1 -3 0 0 0] 1000;
        mu0         mu0 [1 -1 -1 0 0] 1e-3;
        sigma0      sigma0 [1 0 -2 0 0] 0.07;
    }

    injectionModels ();

    forces
    (
        contactAngle
        surfaceShear
        thermocapillary
    );


    contactAngleCoeffs
    {
        deltaWet        1e-4;
        Ccf             1;
        contactAngleDistribution
        {
            type            normal;
            normalDistribution
            {
                minValue        50;
                maxValue        100;
                expectation     75;
                variance        100;
            }
        }
    }

    surfaceShearCoeffs
    {
        Cf          0.001;
    }
}
